vivmchp/hvac_pl10/firmware/config.mcc/src/packs/PIC32CM6408PL10032_DFP/component/tcc.h
/* -------- TCC_FCTRLA : (TCC Offset: 0x0C) (R/W 32) Recoverable Fault Control # -------- */
#define TCC_FCTRLA_RESETVALUE                 _UINT32_(0x00)                                       /*  (TCC_FCTRLA) Recoverable Fault Control #  Reset Value */

#define TCC_FCTRLA_SRC_Pos                    _UINT32_(0)                                          /* (TCC_FCTRLA) Recoverable Fault Source Position */
#define TCC_FCTRLA_SRC_Msk                    (_UINT32_(0x3) << TCC_FCTRLA_SRC_Pos)                /* (TCC_FCTRLA) Recoverable Fault Source Mask */
#define TCC_FCTRLA_SRC(value)                 (TCC_FCTRLA_SRC_Msk & (_UINT32_(value) << TCC_FCTRLA_SRC_Pos)) /* Assignment of value for SRC in the TCC_FCTRLA register */
#define   TCC_FCTRLA_SRC_DISABLE_Val          _UINT32_(0x0)                                        /* (TCC_FCTRLA) Fault input disabled  */
#define   TCC_FCTRLA_SRC_ENABLE_Val           _UINT32_(0x1)                                        /* (TCC_FCTRLA) MCEn (n = 0,1) event input  */
#define   TCC_FCTRLA_SRC_INVERT_Val           _UINT32_(0x2)                                        /* (TCC_FCTRLA) Inverted MCEn (n = 0,1) event input  */
#define   TCC_FCTRLA_SRC_ALTFAULT_Val         _UINT32_(0x3)                                        /* (TCC_FCTRLA) Alternate fault (A or B) state at the end of the previous period.  */
#define TCC_FCTRLA_SRC_DISABLE                (TCC_FCTRLA_SRC_DISABLE_Val << TCC_FCTRLA_SRC_Pos)   /* (TCC_FCTRLA) Fault input disabled Position */
#define TCC_FCTRLA_SRC_ENABLE                 (TCC_FCTRLA_SRC_ENABLE_Val << TCC_FCTRLA_SRC_Pos)    /* (TCC_FCTRLA) MCEn (n = 0,1) event input Position */
#define TCC_FCTRLA_SRC_INVERT                 (TCC_FCTRLA_SRC_INVERT_Val << TCC_FCTRLA_SRC_Pos)    /* (TCC_FCTRLA) Inverted MCEn (n = 0,1) event input Position */
#define TCC_FCTRLA_SRC_ALTFAULT               (TCC_FCTRLA_SRC_ALTFAULT_Val << TCC_FCTRLA_SRC_Pos)  /* (TCC_FCTRLA) Alternate fault (A or B) state at the end of the previous period. Position */
#define TCC_FCTRLA_KEEP_Pos                   _UINT32_(3)                                          /* (TCC_FCTRLA) Recoverable Fault Keep Position */
#define TCC_FCTRLA_KEEP_Msk                   (_UINT32_(0x1) << TCC_FCTRLA_KEEP_Pos)               /* (TCC_FCTRLA) Recoverable Fault Keep Mask */
#define TCC_FCTRLA_KEEP(value)                (TCC_FCTRLA_KEEP_Msk & (_UINT32_(value) << TCC_FCTRLA_KEEP_Pos)) /* Assignment of value for KEEP in the TCC_FCTRLA register */
#define TCC_FCTRLA_QUAL_Pos                   _UINT32_(4)                                          /* (TCC_FCTRLA) Recoverable Fault Qualification Position */
#define TCC_FCTRLA_QUAL_Msk                   (_UINT32_(0x1) << TCC_FCTRLA_QUAL_Pos)               /* (TCC_FCTRLA) Recoverable Fault Qualification Mask */
#define TCC_FCTRLA_QUAL(value)                (TCC_FCTRLA_QUAL_Msk & (_UINT32_(value) << TCC_FCTRLA_QUAL_Pos)) /* Assignment of value for QUAL in the TCC_FCTRLA register */
#define TCC_FCTRLA_BLANK_Pos                  _UINT32_(5)                                          /* (TCC_FCTRLA) Recoverable Fault Blanking Operation Position */
#define TCC_FCTRLA_BLANK_Msk                  (_UINT32_(0x3) << TCC_FCTRLA_BLANK_Pos)              /* (TCC_FCTRLA) Recoverable Fault Blanking Operation Mask */
#define TCC_FCTRLA_BLANK(value)               (TCC_FCTRLA_BLANK_Msk & (_UINT32_(value) << TCC_FCTRLA_BLANK_Pos)) /* Assignment of value for BLANK in the TCC_FCTRLA register */
#define   TCC_FCTRLA_BLANK_START_Val          _UINT32_(0x0)                                        /* (TCC_FCTRLA) Blanking is applied from the start of the ramp period  */
#define   TCC_FCTRLA_BLANK_RISE_Val           _UINT32_(0x1)                                        /* (TCC_FCTRLA) Blanking is applied from the rising edge of the waveform output  */
#define   TCC_FCTRLA_BLANK_FALL_Val           _UINT32_(0x2)                                        /* (TCC_FCTRLA) Blanking is applied from the falling edge of the waveform output  */
#define   TCC_FCTRLA_BLANK_BOTH_Val           _UINT32_(0x3)                                        /* (TCC_FCTRLA) Blanking is applied from each toggle of the waveform output  */
#define TCC_FCTRLA_BLANK_START                (TCC_FCTRLA_BLANK_START_Val << TCC_FCTRLA_BLANK_Pos) /* (TCC_FCTRLA) Blanking is applied from the start of the ramp period Position */
#define TCC_FCTRLA_BLANK_RISE                 (TCC_FCTRLA_BLANK_RISE_Val << TCC_FCTRLA_BLANK_Pos)  /* (TCC_FCTRLA) Blanking is applied from the rising edge of the waveform output Position */
#define TCC_FCTRLA_BLANK_FALL                 (TCC_FCTRLA_BLANK_FALL_Val << TCC_FCTRLA_BLANK_Pos)  /* (TCC_FCTRLA) Blanking is applied from the falling edge of the waveform output Position */
#define TCC_FCTRLA_BLANK_BOTH                 (TCC_FCTRLA_BLANK_BOTH_Val << TCC_FCTRLA_BLANK_Pos)  /* (TCC_FCTRLA) Blanking is applied from each toggle of the waveform output Position */
#define TCC_FCTRLA_RESTART_Pos                _UINT32_(7)                                          /* (TCC_FCTRLA) Recoverable Fault Restart Position */
#define TCC_FCTRLA_RESTART_Msk                (_UINT32_(0x1) << TCC_FCTRLA_RESTART_Pos)            /* (TCC_FCTRLA) Recoverable Fault Restart Mask */
#define TCC_FCTRLA_RESTART(value)             (TCC_FCTRLA_RESTART_Msk & (_UINT32_(value) << TCC_FCTRLA_RESTART_Pos)) /* Assignment of value for RESTART in the TCC_FCTRLA register */
#define TCC_FCTRLA_HALT_Pos                   _UINT32_(8)                                          /* (TCC_FCTRLA) Recoverable Fault Halt Operation Position */
#define TCC_FCTRLA_HALT_Msk                   (_UINT32_(0x3) << TCC_FCTRLA_HALT_Pos)               /* (TCC_FCTRLA) Recoverable Fault Halt Operation Mask */
#define TCC_FCTRLA_HALT(value)                (TCC_FCTRLA_HALT_Msk & (_UINT32_(value) << TCC_FCTRLA_HALT_Pos)) /* Assignment of value for HALT in the TCC_FCTRLA register */
#define   TCC_FCTRLA_HALT_DISABLE_Val         _UINT32_(0x0)                                        /* (TCC_FCTRLA) Halt action disabled  */
#define   TCC_FCTRLA_HALT_HW_Val              _UINT32_(0x1)                                        /* (TCC_FCTRLA) Hardware halt action  */
#define   TCC_FCTRLA_HALT_SW_Val              _UINT32_(0x2)                                        /* (TCC_FCTRLA) Software halt action  */
#define   TCC_FCTRLA_HALT_NR_Val              _UINT32_(0x3)                                        /* (TCC_FCTRLA) Non-recoverable fault  */
#define TCC_FCTRLA_HALT_DISABLE               (TCC_FCTRLA_HALT_DISABLE_Val << TCC_FCTRLA_HALT_Pos) /* (TCC_FCTRLA) Halt action disabled Position */
#define TCC_FCTRLA_HALT_HW                    (TCC_FCTRLA_HALT_HW_Val << TCC_FCTRLA_HALT_Pos)      /* (TCC_FCTRLA) Hardware halt action Position */
#define TCC_FCTRLA_HALT_SW                    (TCC_FCTRLA_HALT_SW_Val << TCC_FCTRLA_HALT_Pos)      /* (TCC_FCTRLA) Software halt action Position */
#define TCC_FCTRLA_HALT_NR                    (TCC_FCTRLA_HALT_NR_Val << TCC_FCTRLA_HALT_Pos)      /* (TCC_FCTRLA) Non-recoverable fault Position */
#define TCC_FCTRLA_CHSEL_Pos                  _UINT32_(10)                                         /* (TCC_FCTRLA) Recoverable Fault Capture Channel Position */
#define TCC_FCTRLA_CHSEL_Msk                  (_UINT32_(0x3) << TCC_FCTRLA_CHSEL_Pos)              /* (TCC_FCTRLA) Recoverable Fault Capture Channel Mask */
#define TCC_FCTRLA_CHSEL(value)               (TCC_FCTRLA_CHSEL_Msk & (_UINT32_(value) << TCC_FCTRLA_CHSEL_Pos)) /* Assignment of value for CHSEL in the TCC_FCTRLA register */
#define   TCC_FCTRLA_CHSEL_CC0_Val            _UINT32_(0x0)                                        /* (TCC_FCTRLA) The captured value stored in CC0  */
#define   TCC_FCTRLA_CHSEL_CC1_Val            _UINT32_(0x1)                                        /* (TCC_FCTRLA) The captured value stored in CC1  */
#define   TCC_FCTRLA_CHSEL_CC2_Val            _UINT32_(0x2)                                        /* (TCC_FCTRLA) The captured value stored in CC2  */
#define   TCC_FCTRLA_CHSEL_CC3_Val            _UINT32_(0x3)                                        /* (TCC_FCTRLA) The captured value stored in CC3  */
#define TCC_FCTRLA_CHSEL_CC0                  (TCC_FCTRLA_CHSEL_CC0_Val << TCC_FCTRLA_CHSEL_Pos)   /* (TCC_FCTRLA) The captured value stored in CC0 Position */
#define TCC_FCTRLA_CHSEL_CC1                  (TCC_FCTRLA_CHSEL_CC1_Val << TCC_FCTRLA_CHSEL_Pos)   /* (TCC_FCTRLA) The captured value stored in CC1 Position */
#define TCC_FCTRLA_CHSEL_CC2                  (TCC_FCTRLA_CHSEL_CC2_Val << TCC_FCTRLA_CHSEL_Pos)   /* (TCC_FCTRLA) The captured value stored in CC2 Position */
#define TCC_FCTRLA_CHSEL_CC3                  (TCC_FCTRLA_CHSEL_CC3_Val << TCC_FCTRLA_CHSEL_Pos)   /* (TCC_FCTRLA) The captured value stored in CC3 Position */
#define TCC_FCTRLA_CAPTURE_Pos                _UINT32_(12)                                         /* (TCC_FCTRLA) Recoverable Fault Capture Action Position */
#define TCC_FCTRLA_CAPTURE_Msk                (_UINT32_(0x7) << TCC_FCTRLA_CAPTURE_Pos)            /* (TCC_FCTRLA) Recoverable Fault Capture Action Mask */
#define TCC_FCTRLA_CAPTURE(value)             (TCC_FCTRLA_CAPTURE_Msk & (_UINT32_(value) << TCC_FCTRLA_CAPTURE_Pos)) /* Assignment of value for CAPTURE in the TCC_FCTRLA register */
#define   TCC_FCTRLA_CAPTURE_DISABLE_Val      _UINT32_(0x0)                                        /* (TCC_FCTRLA) Capture on valid recoverable Fault is disabled  */
#define   TCC_FCTRLA_CAPTURE_CAPT_Val         _UINT32_(0x1)                                        /* (TCC_FCTRLA) On the rising edge of a valid recoverable fault, the counter value is captured on the channel selected by CHSEL[1:0]The INTFLAG.FAULTn flag is set on each new captured value.  */
#define   TCC_FCTRLA_CAPTURE_CAPTMIN_Val      _UINT32_(0x2)                                        /* (TCC_FCTRLA) On the rising edge of a valid recoverable fault, the counter value is captured on the channel selected by CHSEL[1:0] if the COUNT value is lower than the last stored capture value (CC).The INTFLAG.FAULTn flag is set on each local minimum detection.  */
#define   TCC_FCTRLA_CAPTURE_CAPTMAX_Val      _UINT32_(0x3)                                        /* (TCC_FCTRLA) On the rising edge of a valid recoverable fault, the counter value is captured on the channel selected by CHSEL[1:0] if the COUNT value is higher than the last stored capture value (CC).The INTFLAG.FAULTn flag is set on each local maximun detection.  */
#define   TCC_FCTRLA_CAPTURE_LOCMIN_Val       _UINT32_(0x4)                                        /* (TCC_FCTRLA) On the rising edge of a valid recoverable fault, the counter value is captured on the channel selected by CHSEL[1:0].The INTFLAG.FAULTn flag is set on each local minimum value detection.  */
#define   TCC_FCTRLA_CAPTURE_LOCMAX_Val       _UINT32_(0x5)                                        /* (TCC_FCTRLA) On the rising edge of a valid recoverable fault, the counter value is captured on the channel selected by CHSEL[1:0].The INTFLAG.FAULTn flag is set on each local maximun detection.  */
#define   TCC_FCTRLA_CAPTURE_DERIV0_Val       _UINT32_(0x6)                                        /* (TCC_FCTRLA) On the rising edge of a valid recoverable fault, the counter value is captured on the channel selected by CHSEL[1:0].The INTFLAG.FAULTn flag is set on each local maximun or minimum detection.  */
#define   TCC_FCTRLA_CAPTURE_CAPTMARK_Val     _UINT32_(0x7)                                        /* (TCC_FCTRLA) Capture with the ramp index as the MSB value  */
#define TCC_FCTRLA_CAPTURE_DISABLE            (TCC_FCTRLA_CAPTURE_DISABLE_Val << TCC_FCTRLA_CAPTURE_Pos) /* (TCC_FCTRLA) Capture on valid recoverable Fault is disabled Position */
#define TCC_FCTRLA_CAPTURE_CAPT               (TCC_FCTRLA_CAPTURE_CAPT_Val << TCC_FCTRLA_CAPTURE_Pos) /* (TCC_FCTRLA) On the rising edge of a valid recoverable fault, the counter value is captured on the channel selected by CHSEL[1:0]The INTFLAG.FAULTn flag is set on each new captured value. Position */
#define TCC_FCTRLA_CAPTURE_CAPTMIN            (TCC_FCTRLA_CAPTURE_CAPTMIN_Val << TCC_FCTRLA_CAPTURE_Pos) /* (TCC_FCTRLA) On the rising edge of a valid recoverable fault, the counter value is captured on the channel selected by CHSEL[1:0] if the COUNT value is lower than the last stored capture value (CC).The INTFLAG.FAULTn flag is set on each local minimum detection. Position */
#define TCC_FCTRLA_CAPTURE_CAPTMAX            (TCC_FCTRLA_CAPTURE_CAPTMAX_Val << TCC_FCTRLA_CAPTURE_Pos) /* (TCC_FCTRLA) On the rising edge of a valid recoverable fault, the counter value is captured on the channel selected by CHSEL[1:0] if the COUNT value is higher than the last stored capture value (CC).The INTFLAG.FAULTn flag is set on each local maximun detection. Position */
#define TCC_FCTRLA_CAPTURE_LOCMIN             (TCC_FCTRLA_CAPTURE_LOCMIN_Val << TCC_FCTRLA_CAPTURE_Pos) /* (TCC_FCTRLA) On the rising edge of a valid recoverable fault, the counter value is captured on the channel selected by CHSEL[1:0].The INTFLAG.FAULTn flag is set on each local minimum value detection. Position */
#define TCC_FCTRLA_CAPTURE_LOCMAX             (TCC_FCTRLA_CAPTURE_LOCMAX_Val << TCC_FCTRLA_CAPTURE_Pos) /* (TCC_FCTRLA) On the rising edge of a valid recoverable fault, the counter value is captured on the channel selected by CHSEL[1:0].The INTFLAG.FAULTn flag is set on each local maximun detection. Position */
#define TCC_FCTRLA_CAPTURE_DERIV0             (TCC_FCTRLA_CAPTURE_DERIV0_Val << TCC_FCTRLA_CAPTURE_Pos) /* (TCC_FCTRLA) On the rising edge of a valid recoverable fault, the counter value is captured on the channel selected by CHSEL[1:0].The INTFLAG.FAULTn flag is set on each local maximun or minimum detection. Position */
#define TCC_FCTRLA_CAPTURE_CAPTMARK           (TCC_FCTRLA_CAPTURE_CAPTMARK_Val << TCC_FCTRLA_CAPTURE_Pos) /* (TCC_FCTRLA) Capture with the ramp index as the MSB value Position */
#define TCC_FCTRLA_BLANKPRESC_Pos             _UINT32_(15)                                         /* (TCC_FCTRLA) Recoverable Fault Blanking Value Prescaler Position */
#define TCC_FCTRLA_BLANKPRESC_Msk             (_UINT32_(0x1) << TCC_FCTRLA_BLANKPRESC_Pos)         /* (TCC_FCTRLA) Recoverable Fault Blanking Value Prescaler Mask */
#define TCC_FCTRLA_BLANKPRESC(value)          (TCC_FCTRLA_BLANKPRESC_Msk & (_UINT32_(value) << TCC_FCTRLA_BLANKPRESC_Pos)) /* Assignment of value for BLANKPRESC in the TCC_FCTRLA register */
#define TCC_FCTRLA_BLANKVAL_Pos               _UINT32_(16)                                         /* (TCC_FCTRLA) Recoverable Fault Blanking Value Position */
#define TCC_FCTRLA_BLANKVAL_Msk               (_UINT32_(0xFF) << TCC_FCTRLA_BLANKVAL_Pos)          /* (TCC_FCTRLA) Recoverable Fault Blanking Value Mask */
#define TCC_FCTRLA_BLANKVAL(value)            (TCC_FCTRLA_BLANKVAL_Msk & (_UINT32_(value) << TCC_FCTRLA_BLANKVAL_Pos)) /* Assignment of value for BLANKVAL in the TCC_FCTRLA register */
#define TCC_FCTRLA_FILTERVAL_Pos              _UINT32_(24)                                         /* (TCC_FCTRLA) Recoverable Fault Filter Value Position */
#define TCC_FCTRLA_FILTERVAL_Msk              (_UINT32_(0xF) << TCC_FCTRLA_FILTERVAL_Pos)          /* (TCC_FCTRLA) Recoverable Fault Filter Value Mask */
#define TCC_FCTRLA_FILTERVAL(value)           (TCC_FCTRLA_FILTERVAL_Msk & (_UINT32_(value) << TCC_FCTRLA_FILTERVAL_Pos)) /* Assignment of value for FILTERVAL in the TCC_FCTRLA register */
#define TCC_FCTRLA_Msk                        _UINT32_(0x0FFFFFFB)                                 /* (TCC_FCTRLA) Register Mask  */


/* -------- TCC_FCTRLB : (TCC Offset: 0x10) (R/W 32) Recoverable Fault Control # -------- */
#define TCC_FCTRLB_RESETVALUE                 _UINT32_(0x00)                                       /*  (TCC_FCTRLB) Recoverable Fault Control #  Reset Value */

