vivmchp/hvac_pl10/firmware/config.mcc/src/packs/PIC32CM6408PL10032_DFP/component/tcc.h
#define TCC_EVCTRL_TCINV_Pos                  _UINT32_(12)                                         /* (TCC_EVCTRL Position) Timer/Counter Event x Invert Enable */
#define TCC_EVCTRL_TCINV_Msk                  (_UINT32_(0x3) << TCC_EVCTRL_TCINV_Pos)              /* (TCC_EVCTRL Mask) TCINV */
#define TCC_EVCTRL_TCINV(value)               (TCC_EVCTRL_TCINV_Msk & (_UINT32_(value) << TCC_EVCTRL_TCINV_Pos)) 
#define TCC_EVCTRL_TCEI_Pos                   _UINT32_(14)                                         /* (TCC_EVCTRL Position) Timer/Counter Event Input x Enable */
#define TCC_EVCTRL_TCEI_Msk                   (_UINT32_(0x3) << TCC_EVCTRL_TCEI_Pos)               /* (TCC_EVCTRL Mask) TCEI */
#define TCC_EVCTRL_TCEI(value)                (TCC_EVCTRL_TCEI_Msk & (_UINT32_(value) << TCC_EVCTRL_TCEI_Pos)) 
#define TCC_EVCTRL_MCEI_Pos                   _UINT32_(16)                                         /* (TCC_EVCTRL Position) Match or Capture Channel x Event Input Enable */
#define TCC_EVCTRL_MCEI_Msk                   (_UINT32_(0xF) << TCC_EVCTRL_MCEI_Pos)               /* (TCC_EVCTRL Mask) MCEI */
#define TCC_EVCTRL_MCEI(value)                (TCC_EVCTRL_MCEI_Msk & (_UINT32_(value) << TCC_EVCTRL_MCEI_Pos)) 
#define TCC_EVCTRL_MCEO_Pos                   _UINT32_(24)                                         /* (TCC_EVCTRL Position) Match or Capture Channel 3 Event Output Enable */
#define TCC_EVCTRL_MCEO_Msk                   (_UINT32_(0xF) << TCC_EVCTRL_MCEO_Pos)               /* (TCC_EVCTRL Mask) MCEO */
#define TCC_EVCTRL_MCEO(value)                (TCC_EVCTRL_MCEO_Msk & (_UINT32_(value) << TCC_EVCTRL_MCEO_Pos)) 

/* -------- TCC_INTENCLR : (TCC Offset: 0x24) (R/W 32) Interrupt Enable Clear -------- */
#define TCC_INTENCLR_RESETVALUE               _UINT32_(0x00)                                       /*  (TCC_INTENCLR) Interrupt Enable Clear  Reset Value */

#define TCC_INTENCLR_OVF_Pos                  _UINT32_(0)                                          /* (TCC_INTENCLR) Overflow Interrupt Enable Position */
#define TCC_INTENCLR_OVF_Msk                  (_UINT32_(0x1) << TCC_INTENCLR_OVF_Pos)              /* (TCC_INTENCLR) Overflow Interrupt Enable Mask */
#define TCC_INTENCLR_OVF(value)               (TCC_INTENCLR_OVF_Msk & (_UINT32_(value) << TCC_INTENCLR_OVF_Pos)) /* Assignment of value for OVF in the TCC_INTENCLR register */
#define TCC_INTENCLR_TRG_Pos                  _UINT32_(1)                                          /* (TCC_INTENCLR) Retrigger Interrupt Enable Position */
#define TCC_INTENCLR_TRG_Msk                  (_UINT32_(0x1) << TCC_INTENCLR_TRG_Pos)              /* (TCC_INTENCLR) Retrigger Interrupt Enable Mask */
#define TCC_INTENCLR_TRG(value)               (TCC_INTENCLR_TRG_Msk & (_UINT32_(value) << TCC_INTENCLR_TRG_Pos)) /* Assignment of value for TRG in the TCC_INTENCLR register */
#define TCC_INTENCLR_CNT_Pos                  _UINT32_(2)                                          /* (TCC_INTENCLR) Counter Interrupt Enable Position */
#define TCC_INTENCLR_CNT_Msk                  (_UINT32_(0x1) << TCC_INTENCLR_CNT_Pos)              /* (TCC_INTENCLR) Counter Interrupt Enable Mask */
#define TCC_INTENCLR_CNT(value)               (TCC_INTENCLR_CNT_Msk & (_UINT32_(value) << TCC_INTENCLR_CNT_Pos)) /* Assignment of value for CNT in the TCC_INTENCLR register */
#define TCC_INTENCLR_ERR_Pos                  _UINT32_(3)                                          /* (TCC_INTENCLR) Error Interrupt Enable Position */
#define TCC_INTENCLR_ERR_Msk                  (_UINT32_(0x1) << TCC_INTENCLR_ERR_Pos)              /* (TCC_INTENCLR) Error Interrupt Enable Mask */
#define TCC_INTENCLR_ERR(value)               (TCC_INTENCLR_ERR_Msk & (_UINT32_(value) << TCC_INTENCLR_ERR_Pos)) /* Assignment of value for ERR in the TCC_INTENCLR register */
#define TCC_INTENCLR_UFS_Pos                  _UINT32_(10)                                         /* (TCC_INTENCLR) Non-Recoverable Update Fault Interrupt Enable Position */
#define TCC_INTENCLR_UFS_Msk                  (_UINT32_(0x1) << TCC_INTENCLR_UFS_Pos)              /* (TCC_INTENCLR) Non-Recoverable Update Fault Interrupt Enable Mask */
#define TCC_INTENCLR_UFS(value)               (TCC_INTENCLR_UFS_Msk & (_UINT32_(value) << TCC_INTENCLR_UFS_Pos)) /* Assignment of value for UFS in the TCC_INTENCLR register */
#define TCC_INTENCLR_DFS_Pos                  _UINT32_(11)                                         /* (TCC_INTENCLR) Non-Recoverable Debug Fault Interrupt Enable Position */
#define TCC_INTENCLR_DFS_Msk                  (_UINT32_(0x1) << TCC_INTENCLR_DFS_Pos)              /* (TCC_INTENCLR) Non-Recoverable Debug Fault Interrupt Enable Mask */
#define TCC_INTENCLR_DFS(value)               (TCC_INTENCLR_DFS_Msk & (_UINT32_(value) << TCC_INTENCLR_DFS_Pos)) /* Assignment of value for DFS in the TCC_INTENCLR register */
#define TCC_INTENCLR_FAULTA_Pos               _UINT32_(12)                                         /* (TCC_INTENCLR) Recoverable Fault A Interrupt Enable Position */
#define TCC_INTENCLR_FAULTA_Msk               (_UINT32_(0x1) << TCC_INTENCLR_FAULTA_Pos)           /* (TCC_INTENCLR) Recoverable Fault A Interrupt Enable Mask */
#define TCC_INTENCLR_FAULTA(value)            (TCC_INTENCLR_FAULTA_Msk & (_UINT32_(value) << TCC_INTENCLR_FAULTA_Pos)) /* Assignment of value for FAULTA in the TCC_INTENCLR register */
#define TCC_INTENCLR_FAULTB_Pos               _UINT32_(13)                                         /* (TCC_INTENCLR) Recoverable Fault B Interrupt Enable Position */
#define TCC_INTENCLR_FAULTB_Msk               (_UINT32_(0x1) << TCC_INTENCLR_FAULTB_Pos)           /* (TCC_INTENCLR) Recoverable Fault B Interrupt Enable Mask */
#define TCC_INTENCLR_FAULTB(value)            (TCC_INTENCLR_FAULTB_Msk & (_UINT32_(value) << TCC_INTENCLR_FAULTB_Pos)) /* Assignment of value for FAULTB in the TCC_INTENCLR register */
#define TCC_INTENCLR_FAULT0_Pos               _UINT32_(14)                                         /* (TCC_INTENCLR) Non-Recoverable Fault 0 Interrupt Enable Position */
#define TCC_INTENCLR_FAULT0_Msk               (_UINT32_(0x1) << TCC_INTENCLR_FAULT0_Pos)           /* (TCC_INTENCLR) Non-Recoverable Fault 0 Interrupt Enable Mask */
#define TCC_INTENCLR_FAULT0(value)            (TCC_INTENCLR_FAULT0_Msk & (_UINT32_(value) << TCC_INTENCLR_FAULT0_Pos)) /* Assignment of value for FAULT0 in the TCC_INTENCLR register */
#define TCC_INTENCLR_FAULT1_Pos               _UINT32_(15)                                         /* (TCC_INTENCLR) Non-Recoverable Fault 1 Interrupt Enable Position */
#define TCC_INTENCLR_FAULT1_Msk               (_UINT32_(0x1) << TCC_INTENCLR_FAULT1_Pos)           /* (TCC_INTENCLR) Non-Recoverable Fault 1 Interrupt Enable Mask */
#define TCC_INTENCLR_FAULT1(value)            (TCC_INTENCLR_FAULT1_Msk & (_UINT32_(value) << TCC_INTENCLR_FAULT1_Pos)) /* Assignment of value for FAULT1 in the TCC_INTENCLR register */
#define TCC_INTENCLR_MC0_Pos                  _UINT32_(16)                                         /* (TCC_INTENCLR) Match or Capture Channel 0 Interrupt Enable Position */
#define TCC_INTENCLR_MC0_Msk                  (_UINT32_(0x1) << TCC_INTENCLR_MC0_Pos)              /* (TCC_INTENCLR) Match or Capture Channel 0 Interrupt Enable Mask */
#define TCC_INTENCLR_MC0(value)               (TCC_INTENCLR_MC0_Msk & (_UINT32_(value) << TCC_INTENCLR_MC0_Pos)) /* Assignment of value for MC0 in the TCC_INTENCLR register */
#define TCC_INTENCLR_MC1_Pos                  _UINT32_(17)                                         /* (TCC_INTENCLR) Match or Capture Channel 1 Interrupt Enable Position */
#define TCC_INTENCLR_MC1_Msk                  (_UINT32_(0x1) << TCC_INTENCLR_MC1_Pos)              /* (TCC_INTENCLR) Match or Capture Channel 1 Interrupt Enable Mask */
#define TCC_INTENCLR_MC1(value)               (TCC_INTENCLR_MC1_Msk & (_UINT32_(value) << TCC_INTENCLR_MC1_Pos)) /* Assignment of value for MC1 in the TCC_INTENCLR register */
#define TCC_INTENCLR_MC2_Pos                  _UINT32_(18)                                         /* (TCC_INTENCLR) Match or Capture Channel 2 Interrupt Enable Position */
#define TCC_INTENCLR_MC2_Msk                  (_UINT32_(0x1) << TCC_INTENCLR_MC2_Pos)              /* (TCC_INTENCLR) Match or Capture Channel 2 Interrupt Enable Mask */
#define TCC_INTENCLR_MC2(value)               (TCC_INTENCLR_MC2_Msk & (_UINT32_(value) << TCC_INTENCLR_MC2_Pos)) /* Assignment of value for MC2 in the TCC_INTENCLR register */
#define TCC_INTENCLR_MC3_Pos                  _UINT32_(19)                                         /* (TCC_INTENCLR) Match or Capture Channel 3 Interrupt Enable Position */
#define TCC_INTENCLR_MC3_Msk                  (_UINT32_(0x1) << TCC_INTENCLR_MC3_Pos)              /* (TCC_INTENCLR) Match or Capture Channel 3 Interrupt Enable Mask */
#define TCC_INTENCLR_MC3(value)               (TCC_INTENCLR_MC3_Msk & (_UINT32_(value) << TCC_INTENCLR_MC3_Pos)) /* Assignment of value for MC3 in the TCC_INTENCLR register */
#define TCC_INTENCLR_Msk                      _UINT32_(0x000FFC0F)                                 /* (TCC_INTENCLR) Register Mask  */

#define TCC_INTENCLR_FAULT_Pos                _UINT32_(14)                                         /* (TCC_INTENCLR Position) Non-Recoverable Fault x Interrupt Enable */
#define TCC_INTENCLR_FAULT_Msk                (_UINT32_(0x3) << TCC_INTENCLR_FAULT_Pos)            /* (TCC_INTENCLR Mask) FAULT */
#define TCC_INTENCLR_FAULT(value)             (TCC_INTENCLR_FAULT_Msk & (_UINT32_(value) << TCC_INTENCLR_FAULT_Pos)) 
#define TCC_INTENCLR_MC_Pos                   _UINT32_(16)                                         /* (TCC_INTENCLR Position) Match or Capture Channel 3 Interrupt Enable */
#define TCC_INTENCLR_MC_Msk                   (_UINT32_(0xF) << TCC_INTENCLR_MC_Pos)               /* (TCC_INTENCLR Mask) MC */
#define TCC_INTENCLR_MC(value)                (TCC_INTENCLR_MC_Msk & (_UINT32_(value) << TCC_INTENCLR_MC_Pos)) 

/* -------- TCC_INTENSET : (TCC Offset: 0x28) (R/W 32) Interrupt Enable Set -------- */
#define TCC_INTENSET_RESETVALUE               _UINT32_(0x00)                                       /*  (TCC_INTENSET) Interrupt Enable Set  Reset Value */

