vivmchp/hvac_pl10/firmware/config.mcc/src/packs/PIC32CM6408PL10032_DFP/component/tcc.h
/* DUALSLOPE mode */
#define TCC_WAVE_DUALSLOPE_POL0_Pos           _UINT32_(16)                                         /* (TCC_WAVE) Channel 0 Polarity Position */
#define TCC_WAVE_DUALSLOPE_POL0_Msk           (_UINT32_(0x1) << TCC_WAVE_DUALSLOPE_POL0_Pos)       /* (TCC_WAVE) Channel 0 Polarity Mask */
#define TCC_WAVE_DUALSLOPE_POL0(value)        (TCC_WAVE_DUALSLOPE_POL0_Msk & (_UINT32_(value) << TCC_WAVE_DUALSLOPE_POL0_Pos))
#define   TCC_WAVE_DUALSLOPE_POL0_NORMAL_Val  _UINT32_(0x0)                                        /* (TCC_WAVE) Compare output is set to ~DIR when TCC counter matches CCn value  */
#define   TCC_WAVE_DUALSLOPE_POL0_INVERTED_Val _UINT32_(0x1)                                        /* (TCC_WAVE) Compare output is set to DIR when TCC counter matches CCn value.  */
#define TCC_WAVE_DUALSLOPE_POL0_NORMAL        (TCC_WAVE_DUALSLOPE_POL0_NORMAL_Val << TCC_WAVE_DUALSLOPE_POL0_Pos) /* (TCC_WAVE) Compare output is set to ~DIR when TCC counter matches CCn value Position */
#define TCC_WAVE_DUALSLOPE_POL0_INVERTED      (TCC_WAVE_DUALSLOPE_POL0_INVERTED_Val << TCC_WAVE_DUALSLOPE_POL0_Pos) /* (TCC_WAVE) Compare output is set to DIR when TCC counter matches CCn value. Position */
#define TCC_WAVE_DUALSLOPE_POL1_Pos           _UINT32_(17)                                         /* (TCC_WAVE) Channel 1 Polarity Position */
#define TCC_WAVE_DUALSLOPE_POL1_Msk           (_UINT32_(0x1) << TCC_WAVE_DUALSLOPE_POL1_Pos)       /* (TCC_WAVE) Channel 1 Polarity Mask */
#define TCC_WAVE_DUALSLOPE_POL1(value)        (TCC_WAVE_DUALSLOPE_POL1_Msk & (_UINT32_(value) << TCC_WAVE_DUALSLOPE_POL1_Pos))
#define   TCC_WAVE_DUALSLOPE_POL1_NORMAL_Val  _UINT32_(0x0)                                        /* (TCC_WAVE) Compare output is set to ~DIR when TCC counter matches CCn value  */
#define   TCC_WAVE_DUALSLOPE_POL1_INVERTED_Val _UINT32_(0x1)                                        /* (TCC_WAVE) Compare output is set to DIR when TCC counter matches CCn value.  */
#define TCC_WAVE_DUALSLOPE_POL1_NORMAL        (TCC_WAVE_DUALSLOPE_POL1_NORMAL_Val << TCC_WAVE_DUALSLOPE_POL1_Pos) /* (TCC_WAVE) Compare output is set to ~DIR when TCC counter matches CCn value Position */
#define TCC_WAVE_DUALSLOPE_POL1_INVERTED      (TCC_WAVE_DUALSLOPE_POL1_INVERTED_Val << TCC_WAVE_DUALSLOPE_POL1_Pos) /* (TCC_WAVE) Compare output is set to DIR when TCC counter matches CCn value. Position */
#define TCC_WAVE_DUALSLOPE_POL2_Pos           _UINT32_(18)                                         /* (TCC_WAVE) Channel 2 Polarity Position */
#define TCC_WAVE_DUALSLOPE_POL2_Msk           (_UINT32_(0x1) << TCC_WAVE_DUALSLOPE_POL2_Pos)       /* (TCC_WAVE) Channel 2 Polarity Mask */
#define TCC_WAVE_DUALSLOPE_POL2(value)        (TCC_WAVE_DUALSLOPE_POL2_Msk & (_UINT32_(value) << TCC_WAVE_DUALSLOPE_POL2_Pos))
#define   TCC_WAVE_DUALSLOPE_POL2_NORMAL_Val  _UINT32_(0x0)                                        /* (TCC_WAVE) Compare output is set to ~DIR when TCC counter matches CCn value  */
#define   TCC_WAVE_DUALSLOPE_POL2_INVERTED_Val _UINT32_(0x1)                                        /* (TCC_WAVE) Compare output is set to DIR when TCC counter matches CCn value.  */
#define TCC_WAVE_DUALSLOPE_POL2_NORMAL        (TCC_WAVE_DUALSLOPE_POL2_NORMAL_Val << TCC_WAVE_DUALSLOPE_POL2_Pos) /* (TCC_WAVE) Compare output is set to ~DIR when TCC counter matches CCn value Position */
#define TCC_WAVE_DUALSLOPE_POL2_INVERTED      (TCC_WAVE_DUALSLOPE_POL2_INVERTED_Val << TCC_WAVE_DUALSLOPE_POL2_Pos) /* (TCC_WAVE) Compare output is set to DIR when TCC counter matches CCn value. Position */
#define TCC_WAVE_DUALSLOPE_POL3_Pos           _UINT32_(19)                                         /* (TCC_WAVE) Channel 3 Polarity Position */
#define TCC_WAVE_DUALSLOPE_POL3_Msk           (_UINT32_(0x1) << TCC_WAVE_DUALSLOPE_POL3_Pos)       /* (TCC_WAVE) Channel 3 Polarity Mask */
#define TCC_WAVE_DUALSLOPE_POL3(value)        (TCC_WAVE_DUALSLOPE_POL3_Msk & (_UINT32_(value) << TCC_WAVE_DUALSLOPE_POL3_Pos))
#define   TCC_WAVE_DUALSLOPE_POL3_NORMAL_Val  _UINT32_(0x0)                                        /* (TCC_WAVE) Compare output is set to ~DIR when TCC counter matches CCn value  */
#define   TCC_WAVE_DUALSLOPE_POL3_INVERTED_Val _UINT32_(0x1)                                        /* (TCC_WAVE) Compare output is set to DIR when TCC counter matches CCn value.  */
#define TCC_WAVE_DUALSLOPE_POL3_NORMAL        (TCC_WAVE_DUALSLOPE_POL3_NORMAL_Val << TCC_WAVE_DUALSLOPE_POL3_Pos) /* (TCC_WAVE) Compare output is set to ~DIR when TCC counter matches CCn value Position */
#define TCC_WAVE_DUALSLOPE_POL3_INVERTED      (TCC_WAVE_DUALSLOPE_POL3_INVERTED_Val << TCC_WAVE_DUALSLOPE_POL3_Pos) /* (TCC_WAVE) Compare output is set to DIR when TCC counter matches CCn value. Position */
#define TCC_WAVE_DUALSLOPE_Msk                _UINT32_(0x000F0000)                                 /* (TCC_WAVE_DUALSLOPE) Register Mask  */

/* SINGLESLOPE mode */
#define TCC_WAVE_SINGLESLOPE_POL0_Pos         _UINT32_(16)                                         /* (TCC_WAVE) Channel 0 Polarity Position */
#define TCC_WAVE_SINGLESLOPE_POL0_Msk         (_UINT32_(0x1) << TCC_WAVE_SINGLESLOPE_POL0_Pos)     /* (TCC_WAVE) Channel 0 Polarity Mask */
#define TCC_WAVE_SINGLESLOPE_POL0(value)      (TCC_WAVE_SINGLESLOPE_POL0_Msk & (_UINT32_(value) << TCC_WAVE_SINGLESLOPE_POL0_Pos))
#define   TCC_WAVE_SINGLESLOPE_POL0_NORMAL_Val _UINT32_(0x0)                                        /* (TCC_WAVE) Compare output is initialized to ~DIR and set to DIR when TCC counter matches CCn value.  */
#define   TCC_WAVE_SINGLESLOPE_POL0_INVERTED_Val _UINT32_(0x1)                                        /* (TCC_WAVE) Compare output is initialized to DIR and set to ~DIR when TCC counter matches CCn value.  */
#define TCC_WAVE_SINGLESLOPE_POL0_NORMAL      (TCC_WAVE_SINGLESLOPE_POL0_NORMAL_Val << TCC_WAVE_SINGLESLOPE_POL0_Pos) /* (TCC_WAVE) Compare output is initialized to ~DIR and set to DIR when TCC counter matches CCn value. Position */
#define TCC_WAVE_SINGLESLOPE_POL0_INVERTED    (TCC_WAVE_SINGLESLOPE_POL0_INVERTED_Val << TCC_WAVE_SINGLESLOPE_POL0_Pos) /* (TCC_WAVE) Compare output is initialized to DIR and set to ~DIR when TCC counter matches CCn value. Position */
#define TCC_WAVE_SINGLESLOPE_POL1_Pos         _UINT32_(17)                                         /* (TCC_WAVE) Channel 1 Polarity Position */
#define TCC_WAVE_SINGLESLOPE_POL1_Msk         (_UINT32_(0x1) << TCC_WAVE_SINGLESLOPE_POL1_Pos)     /* (TCC_WAVE) Channel 1 Polarity Mask */
#define TCC_WAVE_SINGLESLOPE_POL1(value)      (TCC_WAVE_SINGLESLOPE_POL1_Msk & (_UINT32_(value) << TCC_WAVE_SINGLESLOPE_POL1_Pos))
#define   TCC_WAVE_SINGLESLOPE_POL1_NORMAL_Val _UINT32_(0x0)                                        /* (TCC_WAVE) Compare output is initialized to ~DIR and set to DIR when TCC counter matches CCn value.  */
#define   TCC_WAVE_SINGLESLOPE_POL1_INVERTED_Val _UINT32_(0x1)                                        /* (TCC_WAVE) Compare output is initialized to DIR and set to ~DIR when TCC counter matches CCn value.  */
#define TCC_WAVE_SINGLESLOPE_POL1_NORMAL      (TCC_WAVE_SINGLESLOPE_POL1_NORMAL_Val << TCC_WAVE_SINGLESLOPE_POL1_Pos) /* (TCC_WAVE) Compare output is initialized to ~DIR and set to DIR when TCC counter matches CCn value. Position */
#define TCC_WAVE_SINGLESLOPE_POL1_INVERTED    (TCC_WAVE_SINGLESLOPE_POL1_INVERTED_Val << TCC_WAVE_SINGLESLOPE_POL1_Pos) /* (TCC_WAVE) Compare output is initialized to DIR and set to ~DIR when TCC counter matches CCn value. Position */
#define TCC_WAVE_SINGLESLOPE_POL2_Pos         _UINT32_(18)                                         /* (TCC_WAVE) Channel 2 Polarity Position */
#define TCC_WAVE_SINGLESLOPE_POL2_Msk         (_UINT32_(0x1) << TCC_WAVE_SINGLESLOPE_POL2_Pos)     /* (TCC_WAVE) Channel 2 Polarity Mask */
#define TCC_WAVE_SINGLESLOPE_POL2(value)      (TCC_WAVE_SINGLESLOPE_POL2_Msk & (_UINT32_(value) << TCC_WAVE_SINGLESLOPE_POL2_Pos))
#define   TCC_WAVE_SINGLESLOPE_POL2_NORMAL_Val _UINT32_(0x0)                                        /* (TCC_WAVE) Compare output is initialized to ~DIR and set to DIR when TCC counter matches CCn value.  */
#define   TCC_WAVE_SINGLESLOPE_POL2_INVERTED_Val _UINT32_(0x1)                                        /* (TCC_WAVE) Compare output is initialized to DIR and set to ~DIR when TCC counter matches CCn value.  */
#define TCC_WAVE_SINGLESLOPE_POL2_NORMAL      (TCC_WAVE_SINGLESLOPE_POL2_NORMAL_Val << TCC_WAVE_SINGLESLOPE_POL2_Pos) /* (TCC_WAVE) Compare output is initialized to ~DIR and set to DIR when TCC counter matches CCn value. Position */
#define TCC_WAVE_SINGLESLOPE_POL2_INVERTED    (TCC_WAVE_SINGLESLOPE_POL2_INVERTED_Val << TCC_WAVE_SINGLESLOPE_POL2_Pos) /* (TCC_WAVE) Compare output is initialized to DIR and set to ~DIR when TCC counter matches CCn value. Position */
#define TCC_WAVE_SINGLESLOPE_POL3_Pos         _UINT32_(19)                                         /* (TCC_WAVE) Channel 3 Polarity Position */
#define TCC_WAVE_SINGLESLOPE_POL3_Msk         (_UINT32_(0x1) << TCC_WAVE_SINGLESLOPE_POL3_Pos)     /* (TCC_WAVE) Channel 3 Polarity Mask */
#define TCC_WAVE_SINGLESLOPE_POL3(value)      (TCC_WAVE_SINGLESLOPE_POL3_Msk & (_UINT32_(value) << TCC_WAVE_SINGLESLOPE_POL3_Pos))
#define   TCC_WAVE_SINGLESLOPE_POL3_NORMAL_Val _UINT32_(0x0)                                        /* (TCC_WAVE) Compare output is initialized to ~DIR and set to DIR when TCC counter matches CCn value.  */
#define   TCC_WAVE_SINGLESLOPE_POL3_INVERTED_Val _UINT32_(0x1)                                        /* (TCC_WAVE) Compare output is initialized to DIR and set to ~DIR when TCC counter matches CCn value.  */
#define TCC_WAVE_SINGLESLOPE_POL3_NORMAL      (TCC_WAVE_SINGLESLOPE_POL3_NORMAL_Val << TCC_WAVE_SINGLESLOPE_POL3_Pos) /* (TCC_WAVE) Compare output is initialized to ~DIR and set to DIR when TCC counter matches CCn value. Position */
#define TCC_WAVE_SINGLESLOPE_POL3_INVERTED    (TCC_WAVE_SINGLESLOPE_POL3_INVERTED_Val << TCC_WAVE_SINGLESLOPE_POL3_Pos) /* (TCC_WAVE) Compare output is initialized to DIR and set to ~DIR when TCC counter matches CCn value. Position */
#define TCC_WAVE_SINGLESLOPE_Msk              _UINT32_(0x000F0000)                                 /* (TCC_WAVE_SINGLESLOPE) Register Mask  */


/* -------- TCC_PER : (TCC Offset: 0x40) (R/W 32) Period -------- */
#define TCC_PER_RESETVALUE                    _UINT32_(0xFFFFFFFF)                                 /*  (TCC_PER) Period  Reset Value */

#define TCC_PER_PER_Pos                       _UINT32_(0)                                          /* (TCC_PER) Period Value Position */
#define TCC_PER_PER_Msk                       (_UINT32_(0xFFFF) << TCC_PER_PER_Pos)                /* (TCC_PER) Period Value Mask */
#define TCC_PER_PER(value)                    (TCC_PER_PER_Msk & (_UINT32_(value) << TCC_PER_PER_Pos)) /* Assignment of value for PER in the TCC_PER register */
#define TCC_PER_Msk                           _UINT32_(0x0000FFFF)                                 /* (TCC_PER) Register Mask  */


/* -------- TCC_CC : (TCC Offset: 0x44) (R/W 32) Compare/Capture Channel # -------- */
#define TCC_CC_RESETVALUE                     _UINT32_(0x00)                                       /*  (TCC_CC) Compare/Capture Channel #  Reset Value */

#define TCC_CC_CC_Pos                         _UINT32_(0)                                          /* (TCC_CC) Compare/Capture Channel Value Position */
#define TCC_CC_CC_Msk                         (_UINT32_(0xFFFF) << TCC_CC_CC_Pos)                  /* (TCC_CC) Compare/Capture Channel Value Mask */
#define TCC_CC_CC(value)                      (TCC_CC_CC_Msk & (_UINT32_(value) << TCC_CC_CC_Pos)) /* Assignment of value for CC in the TCC_CC register */
#define TCC_CC_Msk                            _UINT32_(0x0000FFFF)                                 /* (TCC_CC) Register Mask  */


/* -------- TCC_PATTBUF : (TCC Offset: 0x64) (R/W 16) Pattern Buffer -------- */
#define TCC_PATTBUF_RESETVALUE                _UINT16_(0x00)                                       /*  (TCC_PATTBUF) Pattern Buffer  Reset Value */

